Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: The address of a literal string is valid until the program exits.
ja: リテラル文字列のアドレスは、プログラムが終了するまで有効である。

source: The address of a notification structure derived from NMHDR.
ja: NMHDRから派生した通知構造体のアドレス。

source: The address of a temporary string is valid only until evaluation of the overall expression or function call statement is completed, after which time it must not be used.
ja: 一時文字列のアドレスは、式全体または関数呼び出し文の評価が完了するまでのみ有効で、それ以降は使用してはならない。

source: The address of the contents of a function's local variable is not valid after the function returns, as local variables are freed automatically.
ja: ローカル変数は自動的に解放されるため、関数のローカル変数の内容のアドレスは、関数が戻った後は無効となる。

source: The address of the data contained by the object.
ja: オブジェクトが含むデータのアドレス。

source: The address should be considered valid only until the variable is freed or has been reassigned by means of any of the assignment operators or by passing it to a built-in function.
ja: このアドレスは、変数が解放されるのみか、代入演算子によって再代入されるか、組み込み関数に渡されるまで有効であるとみなされるべきである。

source: The advantage is that although the hotkey will fire upon release, it will do so only if you did not press any other key while it was held down.
ja: この利点は、ホットキーは離すと起動しますが、押している間に他のキーを押さなかった場合にのみ起動することです。

source: The advantage of this is that it makes it easier for the user to drag a rectangle around a group of rows to select them.
ja: この利点は、ユーザーが行のグループを選択するために矩形をドラッグすることが容易になることです。

source: The ahk_ keyword and its criterion value do not need to be separated by spaces or tabs.
ja: ahk_キーワードとその基準値は、スペースやタブで区切る必要はない。

source: The ahk_id criterion can also be combined with other criteria that the given window must match.
ja: ahk_id基準は、与えられたウィンドウがマッチしなければならない他の基準と組み合わせることもできる。

source: The algorithm for determining a value's class name can be approximated as shown below:
ja: 値のクラス名を決定するアルゴリズムは、おおよそ以下のようになります：

source: The amount of time to add, as an integer or floating-point number.
ja: 加算する時間を、整数または浮動小数点数で指定します。

source: The amount of time to pause (in milliseconds) between 0 and 2147483647 (24 days).
ja: 0から2147483647（24日間）の間の休止時間（ミリ秒）。

source: The app can't keep up with a rapid stream of keystrokes, and you need to slow them all down.
ja: キーストロークの急激な流れにアプリがついていけず、すべてをスローダウンさせる必要があります。

source: The area to which TargetType is to be related.
ja: TargetTypeが関連する領域。

source: The array index, typically the same as A_Index.
ja: 配列のインデックス。通常はA_Indexと同じ。

source: The array's length is reduced by 1.
ja: 配列の長さが1短くなる。

source: The asterisk indicates that the user is permitted to navigate upward (closer to the root) from the starting folder.
ja: アスタリスクは、ユーザーが開始フォルダから上へ（ルートに近い方へ）移動することを許可されていることを示します。

source: The asterisk must immediately precede the closing parenthesis at the end of the function's parameter list.
ja: アスタリスクは、関数のパラメータリストの最後にある閉じ括弧の直前でなければなりません。

source: The attributes to change.
ja: 変えるべき属性。

source: The auto-execute section can now easily span the entire script, so may instead be referred to as global code, executing within the auto-execute thread.
ja: 自動実行セクションは、スクリプト全体を容易にカバーできるようになったので、自動実行スレッド内で実行されるグローバルコードと呼ばれることもあります。

source: The availability of some fonts may depend on the language of the operating system.
ja: 一部のフォントは、オペレーティング・システムの言語に依存する場合があります。

source: The base file search algorithm runs for a short amount of time when Ahk2Exe starts, and works as follows:
ja: ベースファイル検索アルゴリズムは、Ahk2Exeの起動時に短時間実行され、以下のように動作します：

source: The base file to be used (a .bin or .exe file).
ja: 使用するベースファイル（.binまたは.exeファイル）。

source: The base files included in the Compiler directory have the ".bin" extension; these are versions of the interpreter which do not include the capability to load external script files.
ja: Compilerディレクトリに含まれる基本ファイルの拡張子は「.bin」である。これらは、外部スクリプトファイルを読み込む機能を含まないバージョンのインタープリターである。

source: The base type of the array (the VARTYPE of each element of the array).
ja: 配列の基本型（配列の各要素のVARTYPE）。

source: The behavior and appearance of the tray icon and menu can be customized:
ja: トレイアイコンとメニューの動作と外観はカスタマイズできる：

source: The best way to add new elements to the array is to call InsertAt or Push.
ja: 配列に新しい要素を追加するには、InsertAtまたはPushを呼び出すのが最適です。

source: The binary data contained by the object consists of a four-byte format type, followed by a four-byte data-block size, followed by the data-block for that format.
ja: オブジェクトが含むバイナリデータは、4バイトのフォーマットタイプ、4バイトのデータブロックサイズ、そのフォーマットのデータブロックの順で構成されます。

source: The block following a double-colon hotkey is implicitly the body of a function, but that is only important when you define your own variables.
ja: ダブルコロンホットキーに続くブロックは暗黙のうちに関数本体となりますが、これは独自の変数を定義する場合にのみ重要です。

source: The bold 0 above is the zero-based part number.
ja: 上記の太字の0は、ゼロベースの部品番号である。

source: The bottommost window is typically the one least recently used, except when windows have been reordered, such as with WinMoveBottom.
ja: WinMoveBottomなどでウィンドウの並び替えが行われた場合を除き、一番下のウィンドウは通常、最も最近使用されたウィンドウである。

source: The buffer is not freed until the Buffer object's reference count reaches zero, but it is reallocated when its Size is changed.
ja: バッファはBufferオブジェクトの参照カウントが0になるまで解放されませんが、Sizeが変更されると再割り当てされます。

source: The buffer's address typically changes whenever its size is changed.
ja: バッファのアドレスは通常、そのサイズが変更されるたびに変更されます。

source: The built-in "variables" true, false, A_PtrSize, A_Index and A_EventInfo always return pure integers, not strings.
ja: 組み込みの「変数」のtrue、false、A_PtrSize、A_Index、A_EventInfoは常に純粋な整数を返し、文字列は返しません。

source: The built-in "variables" true, false, A_PtrSize, A_IsUnicode, A_Index and A_EventInfo always return pure integers, not strings.
ja: 組み込みの「変数」のtrue,false,A_PtrSize,A_IsUnicode,A_Index,A_EventInfoは常に純粋な整数を返し、文字列は返しません。

source: The built-in A_CoordMode variables contain the current settings.
ja: 組み込みのA_CoordMode変数には、現在の設定が格納されています。

source: The built-in variable A_Clipboard reflects the current contents of the Windows clipboard expressed as plain text, but can be assigned a ClipboardAll object to restore its content to the clipboard.
ja: 組込変数A_Clipboardは、プレーンテキストとして表現されたWindowsクリップボードの現在の内容を反映しますが、ClipboardAllオブジェクトを割り当てて、その内容をクリップボードに復元することができます。

source: The built-in variable A_IsCompiled contains 1 if the script is running in compiled form.
ja: 組み込み変数A_IsCompiledは、スクリプトがコンパイルされた形式で実行されている場合、1を含む。

source: The built-in variable A_LastError contains the result of the operating system's GetLastError() function.
ja: 組込変数A_LastErrorには、オペレーティングシステムのGetLastError()関数の結果が格納されます。

source: The built-in variable A_LastError is set to the result of the operating system's GetLastError() function.
ja: 組込変数A_LastErrorには、オペレーティングシステムのGetLastError()関数の結果が設定されます。

source: The built-in variable A_Now contains the current local time in the above format.
ja: 組み込み変数A_Nowには、上記のフォーマットで現在のローカルタイムが格納されています。

source: The built-in variable A_ScriptHwnd contains the unique ID (HWND) of the script's main window.
ja: 組み込み変数A_ScriptHwndには、スクリプトのメインウィンドウの一意なID（HWND）が格納されます。

source: The built-in variable A_ControlDelay contains the current setting and can also be assigned a new value instead of calling SetControlDelay.
ja: 内蔵変数A_ControlDelayには現在の設定値が格納され、SetControlDelayを呼び出す代わりに新しい値を割り当てることも可能です。

source: The built-in variable A_DefaultMouseSpeed contains the current setting.
ja: 組込変数A_DefaultMouseSpeedに現在の設定値が格納されます。

source: The built-in variable A_DetectHiddenText contains the current setting (1 or 0).
ja: 組込変数A_DetectHiddenTextに現在の設定値（1または0）が格納されます。

source: The built-in variable A_DetectHiddenWindows contains the current setting (1 or 0).
ja: 内蔵変数A_DetectHiddenWindowsに現在の設定値（1または0）が格納されます。

source: The built-in variable A_EndChar contains the ending character that you typed to trigger the most recent non-auto-replace hotstring.
ja: 内蔵変数A_EndCharには、直近の自動置換でないホットストリングを起動するために入力した終了文字が格納されます。

source: The built-in variable A_EventInfo contains the amount by which the wheel was turned, which is typically 120.
ja: 組込変数A_EventInfoには、ホイールが回転した量（通常120）が格納されます。

source: The built-in variable A_FileEncoding contains the current setting.
ja: 組込変数A_FileEncodingに現在の設定が格納されます。

source: The built-in variable A_HotkeyModifierTimeout defines how long after a hotkey is pressed that its modifier keys are assumed to still be held down.
ja: 組込変数A_HotkeyModifierTimeoutは、ホットキーが押されてから、その修飾キーがまだ押されているとみなされるまでの時間を定義します。

source: The built-in variable A_IconHidden contains 1 if the tray icon is currently hidden or 0 otherwise, and can be assigned a value to show or hide the icon.
ja: 組み込み変数A_IconHiddenは、トレイアイコンが現在隠されている場合は1、そうでない場合は0を含み、アイコンを表示または隠すための値を代入することができる。

source: The built-in variable A_Index contains the number of the current loop iteration.
ja: 組込変数A_Indexには、現在のループの繰り返し回数が格納されます。

source: The built-in variable A_IsPaused contains 1 if the thread immediately underneath the current thread is paused and 0 otherwise.
ja: 組み込み変数A_IsPausedは、現在のスレッドの直下にあるスレッドが一時停止しているときは1を、そうでないときは0を格納します。

source: The built-in variable A_IsSuspended contains 1 if the script is suspended and 0 otherwise.
ja: 組み込み変数A_IsSuspendedには、スクリプトが中断されている場合は1が格納され、そうでない場合は0が格納される。

source: The built-in variable A_KeyDelay contains the current setting of Delay for Send/SendEvent mode.
ja: 組込変数A_KeyDelayには、Send/SendEvent モードのDelayの現在の設定値が格納される。

source: The built-in variable A_ListLines contains 1 if ListLines is enabled and 0 otherwise.
ja: 組み込み変数であるA_ListLinesは、ListLinesが有効な場合は1を、そうでない場合は0を格納します。

source: The built-in variable A_LoopField exists within any parsing loop.
ja: 組込変数A_LoopFieldは、任意の構文解析ループ内に存在します。

source: The built-in variable A_LoopReadLine exists within any file-reading loop.
ja: 組み込み変数A_LoopReadLineは、任意のファイル読み込みループ内に存在します。

source: The built-in variable A_MouseDelay contains the current setting for Send/SendEvent mode.
ja: 組込変数A_MouseDelayには、Send/SendEvent モードの現在の設定値が格納されます。

source: The built-in variable A_Now contains the current local time in YYYYMMDDHH24MISS format.
ja: 組込変数A_Nowには、現在のローカルタイムがYYYYMMDDHH24MISS形式で格納されます。

source: The built-in variable A_RegView contains the current setting.
ja: 組込変数A_RegViewには、現在の設定値が格納されています。

source: The built-in variable A_SendLevel contains the current setting.
ja: 内蔵変数A_SendLevelには、現在の設定値が格納されます。

source: The built-in variable A_SendMode contains the current setting.
ja: 組込変数A_SendModeには、現在の設定が格納されています。

source: The built-in variable A_StoreCapsLockMode contains the current setting (1 or 0).
ja: 組込変数A_StoreCapsLockModeには、現在の設定値（1または0）が格納されます。

source: The built-in variable A_WinDelay contains the current setting.
ja: 組込変数A_WinDelayには、現在の設定が格納されています。

source: The built-in variables A_ScreenWidth and A_ScreenHeight contain the dimensions of the primary monitor, in pixels.
ja: 内蔵変数A_ScreenWidthとA_ScreenHeightには、プライマリモニタの寸法がピクセル単位で格納されます。

source: The built-in variables A_IconNumber and A_IconFile contain the number and name (with full path) of the current icon (both are blank if the icon is the default).
ja: 組み込み変数A_IconNumberと A_IconFileには、現在のアイコンの番号と名前（フルパス付き）が格納される（アイコンがデフォルトの場合は両方とも空白）。

source: The built-in variables A_Space and A_Tab contain a single space and a single tab character, respectively.
ja: 組み込み変数A_Spaceと A_Tabには、それぞれスペースとタブが1文字ずつ格納される。

source: The built-in variables A_TitleMatchMode and A_TitleMatchModeSpeed contain the current settings.
ja: 組み込み変数A_TitleMatchModeとA_TitleMatchModeSpeedには、現在の設定が格納されています。

source: The button looks raised when it isn't pushed or checked, and sunken when it is pushed or checked.
ja: ボタンが押されたりチェックされたりしないときは盛り上がって見え、押されたりチェックされたりすると沈んで見える。

source: The buttons of the joystick.
ja: ジョイスティックのボタンです。

source: The calendar will drop down on the right side of the control instead of the left.
ja: カレンダーはコントロールの左側ではなく、右側にドロップダウンされます。

source: The callback accepts four parameters and can be defined as follows:
ja: コールバックは4つのパラメーターを受け取り、以下のように定義できる：

source: The callback accepts one parameter and can be defined as follows:
ja: コールバックは 1 つのパラメーターを受け取り、次のように定義できます。

source: The callback accepts three parameters and can be defined as follows:
ja: コールバックは3つのパラメーターを受け取り、以下のように定義できる：

source: The callback accepts two parameters and can be defined as follows:
ja: コールバックは2つのパラメーターを受け取り、以下のように定義できます：

source: The callback can declare more parameters than the event provides if (and only if) the additional parameters are declared optional.
ja: コールバックは、追加のパラメータがオプションとして宣言されている場合（そしてその場合のみ）、イベントが提供するよりも多くのパラメータを宣言することができます。

source: The callback can hide the window immediately by calling Gui.Hide, or destroy the window by calling Gui.Destroy.
ja: コールバックは、Gui.Hideを呼び出すことでウィンドウをすぐに隠すことができ、Gui.Destroyを呼び出すことでウィンドウを破壊することができます。

source: The callback can hide the window immediately by calling GuiObj.Hide, or destroy the window by calling GuiObj.Destroy.
ja: コールバックは、GuiObj.Hideを呼び出すことでウィンドウをすぐに隠すことができ、GuiObj.Destroyを呼び出すことでウィンドウを破壊することができます。

source: The callback function can return one of the following values (other values are reserved for future use and should be avoided):
ja: コールバック関数は、以下のいずれかの値を返すことができます（その他の値は将来の使用のために予約されており、避ける必要があります）：

source: The callback receives one parameter:
ja: コールバックは1つのパラメーターを受け取ります：

source: The callback receives two parameters:
ja: コールバックは2つのパラメーターを受け取ります：

source: The callback retains a reference to the function object, and releases it when the script calls CallbackFree.
ja: コールバックは関数オブジェクトへの参照を保持し、スクリプトがCallbackFreeを呼び出すとその参照を解放します。

source: The callback uses the same global (or thread-specific) settings as the Sort function that called it.
ja: コールバックは、それを呼び出したSort関数と同じグローバルな（あるいはスレッド固有の）設定を使用します。

source: The callback's first explicit parameter is the Gui or GuiControl object which raised the event.
ja: コールバックの最初の明示的なパラメータは、イベントを発生させたGuiまたはGuiControlオブジェクトです。

source: The callback's return value is ignored by the GUI control.
ja: コールバックの戻り値は、GUIコントロールに無視されます。

source: The callback's return value may have additional meaning, depending on the notification.
ja: 通知内容によっては、コールバックの戻り値が追加の意味を持つことがあります。

source: The caller can continue enumeration at the next property only if it retained a reference to the enumerator (i.e. not if it passed the enumerator directly to a for-loop, since in that case the enumerator is freed when the for-loop aborts).
ja: 呼び出し側は、列挙子への参照を保持している場合にのみ、次のプロパティで列挙を続けることができます（つまり、列挙子を直接forループに渡した場合は、forループがアボートしたときに列挙子が解放されるため、列挙子を渡さない）。

source: The caller of a function should generally know what each parameter means and how many there are before calling the function.
ja: 関数の呼び出し側は、一般に、関数を呼び出す前に各パラメータの意味と個数を知っておく必要があります。

source: The case-sensitive equality operators (== and !==) can be used to compare binary data.
ja: バイナリデータの比較には、大文字と小文字を区別する等号演算子（==と !==）が使えます。

source: The characters [, ] and ? are reserved for use in expressions, so are no longer valid in variable names.
ja: [、]、?は式で使うために予約されているため、変数名には使えません。

source: The characters {} are used to enclose key names and other options, and to send special characters literally.
ja: 文字{}は、キー名やその他のオプションを囲んだり、特殊文字を文字通りに送信するために使用します。

source: The characters ^+!# represent the modifier keys Ctrl, Shift, Alt and Win.
ja: 文字^+!#は、修飾キーCtrl、Shift、Alt、Winを表します。

source: The characters Ctrl+A through Ctrl+Z correspond to Chr(1) through Chr(26).
ja: Ctrl+AからCtrl+Zは、Chr(1) から Chr(26)に対応しています。

source: The characters `n and `t are among those ignored because by the time they get to PCRE, they are already raw/literal whitespace characters (by contrast, \n and \t are not ignored because they are PCRE escape sequences).
ja: `n と `t は PCRE に到達した時点で、すでに生の/リテラルな空白文字であるため無視されます（対照的に、 \n と\t は PCRE のエスケープシーケンスであるため無視されません）。

source: The checks which produce VarUnset, LocalSameAsGlobal and Unreachable warnings are performed after all directives have been parsed, but before the script executes.
ja: VarUnset、LocalSameAsGlobal、Unreachableの警告を出すチェックは、すべてのディレクティブがパースされた後、スクリプトが実行される前に行われます。

source: The class and process name are often used when identifying a window by title alone is not feasible.
ja: クラス名やプロセス名は、タイトルだけでウィンドウを特定することができない場合によく使われます。

source: The class has a Prototype object, on which all instances of the class are based.
ja: クラスにはPrototypeオブジェクトがあり、このオブジェクトを基にクラスのすべてのインスタンスが作られる。

source: The class itself is an object, containing only static methods and properties.
ja: クラスそのものはオブジェクトで、静的メソッドとプロパティだけを含んでいる。

source: The class of value that should be caught, such as Error, TimeoutError or MyCustomError.
ja: Error、TimeoutError、MyCustomErrorなど、捕捉すべき値のクラスです。

source: The client area is the part of the window which can contain controls.
ja: クライアント領域はウィンドウの一部で、コントロールを含むことができます。

source: The clone has the same base object as the original object.
ja: クローンは、元のオブジェクトと同じベースオブジェクトを持ちます。

source: The code of such a key can be determined by following the steps at the bottom of the key list page.
ja: このようなキーのコードは、キー一覧ページ下部の手順で判別することができます。

source: The code page to use for text I/O if the file does not contain a UTF-8 or UTF-16 byte order mark, or if the h (handle) flag is used.
ja: ファイルにUTF-8またはUTF-16のバイトオーダーマークがない場合、またはh（ハンドル）フラグが使用されている場合に、テキストI/Oに使用するコードページです。

source: The color ID to search for.
ja: 検索するカラーIDを指定します。

source: The color of the menu bar and its submenus can be changed as in this example:
ja: この例のように、メニューバーと、そのサブメニューの色を変更することができます：

source: The color of the menu bar and its submenus can be changed as in this example: MyMenuBar.SetColor "White".
ja: この例のように、メニューバーと、そのサブメニューの色を変更することができます：MyMenuBar.SetColor "White"。

source: The color value can be omitted; for example, WinSetTransColor " 150" (with the leading space) is equivalent to WinSetTransparent 150.
ja: 例えば、WinSetTransColor " 150"（先頭スペースあり）は、WinSetTransparent 150と同じです。

source: The column "Exists Since" represents the first Windows version in which the font was included.
ja: "Exists Since"の列は、そのフォントが含まれていた最初のWindowsバージョンを表しています。

source: The column number of the newly inserted column.
ja: 新しく挿入された列の列番号。

source: The column starts off in descending order the first time the user sorts it.
ja: ユーザーが初めてソートするときは、列は降順で始まります。

source: The column to delete.
ja: 削除する列を指定します。

source: The column to modify.
ja: 修正する列です。

source: The columns in a ListView can be resized via SendMessage as shown in this example:
ja: この例のように、SendMessageを介してListViewのカラムのサイズを変更することができます：

source: The columns of the new row, which can be text or numeric (including numeric expression results).
ja: 新しい行の列で、テキストまたは数値（数値式の結果を含む）を指定することができます。

source: The comma after the second word is now optional.
ja: 2語目以降のカンマは任意となりました。

source: The command or expression to obey.
ja: 従えという命令や表現。

source: The command prompt and fancy editors usually display both.
ja: コマンドプロンプトやファンシーエディターでは、通常両方表示されます。

source: The comparison is case-insensitive according to the rules of the current user's locale.
ja: 比較は、現在のユーザーのロケールのルールに従って、大文字と小文字を区別しない。

source: The comparison is case-sensitive.
ja: 大文字と小文字を区別して比較します。

source: The comparison is not case-sensitive, i.e. the letters A-Z are considered identical to their lowercase counterparts.
ja: 大文字と小文字を区別して比較しません。つまり、AからZまでの文字は、その小文字と同じものとみなされます。

source: The compilation process creates an executable file which contains the following:
ja: コンパイル・プロセスは、以下を含む実行可能ファイルを作成する：

source: The compilation process creates an executable file which contains the following: the AutoHotkey interpreter, the script, any files it includes, and any files it has incorporated via the FileInstall function.
ja: コンパイル・プロセスは、以下を含む実行可能ファイルを作成する：AutoHotkeyインタープリタ、スクリプト、スクリプトに含まれるファイル、FileInstall関数で取り込んだファイル。

source: The compiler distinguishes script versions by checking the major version of the base file supplied.
ja: コンパイラーは、提供されたベースファイルのメジャーバージョンをチェックすることで、スクリプトのバージョンを区別する。

source: The compiler will be run at least once for each Bin/Base directive found.
ja: コンパイラは、Bin/Baseディレクティブが見つかるたびに少なくとも1回は実行されます。

source: The compiler will be run for each *.bin or *.exe file that matches.
ja: コンパイラーは、マッチした*.binまたは*.exeファイルごとに実行される。

source: The compiler's source code and newer versions can be found at GitHub.
ja: コンパイラーのソースコードと新しいバージョンはGitHubで見ることができる。

source: The complete PCRE manual is at www.pcre.org/pcre.txt
ja: PCREマニュアルの完全版はwww.pcre.org/pcre.txtにあります。

source: The complete content of a section to write to the .ini file, excluding the [SectionName] header.
ja: .iniファイルに書き込むセクションの完全な内容（[SectionName]ヘッダを除く）です。

source: The component's display name and/or index.
ja: コンポーネントの表示名とインデックス。

source: The components can appear in any order except ClickCount, which must occur somewhere to the right of Coords, if present.
ja: コンポーネントは、ClickCountを除いてどのような順番で表示されても構わないが、存在する場合はCoordsの右側のどこかに表示されなければならない。

source: The components may be spread across multiple parameters or combined into one or more strings.
ja: 構成要素は複数のパラメータにまたがっていてもよいし、文字列にまとめられていてもよい。

source: The compression state of files cannot be changed with this function.
ja: この機能でファイルの圧縮状態を変更することはできません。

source: The condition for an Else statement executing depends on the associated statement:
ja: Else文の実行条件は、関連する文に依存します：

source: The console session is not necessarily the physical console.
ja: コンソール・セッションは、必ずしも物理的なコンソールとは限らない。

source: The contents of this tooltip can be changed via:
ja: このツールチップの内容は、以下の方法で変更できる：

source: The contents of this tooltip can be changed via: A_IconTip := "My New Text".
ja: このツールチップの内容は、以下の方法で変更できる：A_IconTip := "私の新しいテキスト"。

source: The control automatically wraps words that extend past the end of a line to the beginning of the next centered line.
ja: コントロールは、行末からはみ出した単語を自動的に次の中央の行の先頭に折り返す。

source: The control displays a selection range only.
ja: コントロールは選択範囲のみを表示する。

source: The control displays tick marks at the top of the control (or to its left if TBS_VERT is present).
ja: コントロールの上部（TBS_VERTがある場合はその左側）に目盛りが表示される。

source: The control displays tick marks on both sides of the control.
ja: コントロールは、コントロールの両側にティックマークを表示する。

source: The control does not display any tick marks.
ja: コントロールにはティックマークは表示されない。

source: The control does not display the moveable bar.
ja: コントロールに可動バーが表示されない。

source: The control gains the keyboard focus.
ja: コントロールがキーボードフォーカスを獲得します。

source: The control has a tick mark for each increment in its range of values.
ja: コントロールは、値の範囲内の各増分に目盛りが付いています。

source: The control is clicked.
ja: コントロールがクリックされます。

source: The control is double-clicked.
ja: コントロールがダブルクリックされます。

source: The control is initially invisible.
ja: コントロールは、初期状態では不可視です。

source: The control is oriented vertically.
ja: コントロールは縦向き。

source: The control loses the keyboard focus.
ja: コントロールはキーボードフォーカスを失います。

source: The control must have been created by the current script via Gui.Add.
ja: コントロールは、MyGui.Addで作成されたものでなければなりません。

source: The control must have been created by the current script via MyGui.Add.
ja: コントロールは、MyGui.Addで作成されている必要があります。

source: The control must have been created by the current script, by calling Add or AddControlType.
ja: コントロールは、Add またはAddControlTypeを呼び出して、現在のスクリプトによって作成されている必要があります。

source: The control retrieved by this function is the one that has keyboard focus, that is, the one that would receive keystrokes if the user were to type any.
ja: この関数で取得されるコントロールは、キーボードフォーカスを持つもの、つまり、ユーザーが何か入力した場合にキーストロークを受け取ることになるものです。

source: The control sends DTN_USERSTRING notification messages when users are finished.
ja: ユーザが終了すると、コントロールはDTN_USERSTRING通知メッセージを送信する。

source: The control supports tooltips.
ja: コントロールはツールチップをサポートしています。

source: The control will be multi-line if it has more than one row of text.
ja: コントロールは、テキストが2行以上ある場合、複数行になります。

source: The control will not display any horizontal scroll bars.
ja: コントロールは水平スクロールバーを表示しない。

source: The control will not display any scroll bars.
ja: コントロールはスクロールバーを表示しない。

source: The control's ClassNN, text or HWND, or an object with a Hwnd property.
ja: コントロールのClassNN、テキスト、HWND、またはHwndプロパティを持つオブジェクトを指します。

source: The control's HWND, which is typically retrieved via ControlGetHwnd, MouseGetPos, or DllCall.
ja: コントロールのHWND。通常、ControlGetHwnd、MouseGetPos、またはDllCallによって取得されます。

source: The control's HWND.
ja: コントロールのHWNDです。
